zephyrproject-rtos/hal_atmel/include/dt-bindings/pinctrl/same70q-pinctrl.h
/* pa16_gpio */
#define PA16_GPIO \
	SAM_PINMUX(a, 16, gpio, gpio)

/* pa16a_ebi_d15 */
#define PA16A_EBI_D15 \
	SAM_PINMUX(a, 16, a, periph)

/* pa16b_tc0_tiob1 */
#define PA16B_TC0_TIOB1 \
	SAM_PINMUX(a, 16, b, periph)

/* pa16c_pwmc0_pwml2 */
#define PA16C_PWMC0_PWML2 \
	SAM_PINMUX(a, 16, c, periph)

/* pa16d_i2sc0_di */
#define PA16D_I2SC0_DI \
	SAM_PINMUX(a, 16, d, periph)

/* pa17_gpio */
#define PA17_GPIO \
	SAM_PINMUX(a, 17, gpio, gpio)

/* pa17a_qspi_qio2 */
#define PA17A_QSPI_QIO2 \
	SAM_PINMUX(a, 17, a, periph)

/* pa17b_pmc_pck1 */
#define PA17B_PMC_PCK1 \
	SAM_PINMUX(a, 17, b, periph)

/* pa17c_pwmc0_pwmh3 */
#define PA17C_PWMC0_PWMH3 \
	SAM_PINMUX(a, 17, c, periph)

/* pa17x_afe0_ad6 */
#define PA17X_AFE0_AD6 \
	SAM_PINMUX(a, 17, x, extra)

/* pa18_gpio */
#define PA18_GPIO \
	SAM_PINMUX(a, 18, gpio, gpio)

/* pa18a_pwmc1_pwmextrg1 */
#define PA18A_PWMC1_PWMEXTRG1 \
	SAM_PINMUX(a, 18, a, periph)

/* pa18b_pmc_pck2 */
#define PA18B_PMC_PCK2 \
	SAM_PINMUX(a, 18, b, periph)

/* pa18c_ebi_a14 */
#define PA18C_EBI_A14 \
	SAM_PINMUX(a, 18, c, periph)

/* pa18x_afe0_ad7 */
#define PA18X_AFE0_AD7 \
	SAM_PINMUX(a, 18, x, extra)

/* pa19_gpio */
#define PA19_GPIO \
	SAM_PINMUX(a, 19, gpio, gpio)

/* pa19b_pwmc0_pwml0 */
#define PA19B_PWMC0_PWML0 \
	SAM_PINMUX(a, 19, b, periph)

/* pa19c_ebi_a15 */
#define PA19C_EBI_A15 \
	SAM_PINMUX(a, 19, c, periph)

/* pa19d_i2sc1_mck */
#define PA19D_I2SC1_MCK \
	SAM_PINMUX(a, 19, d, periph)

/* pa19x_afe0_ad8 */
#define PA19X_AFE0_AD8 \
	SAM_PINMUX(a, 19, x, extra)

/* pa19x_supc_wkup9 */
#define PA19X_SUPC_WKUP9 \
	SAM_PINMUX(a, 19, wkup9, wakeup)

/* pa20_gpio */
#define PA20_GPIO \
	SAM_PINMUX(a, 20, gpio, gpio)

/* pa20b_pwmc0_pwml1 */
#define PA20B_PWMC0_PWML1 \
	SAM_PINMUX(a, 20, b, periph)

/* pa20c_ebi_a16_ba0 */
#define PA20C_EBI_A16_BA0 \
	SAM_PINMUX(a, 20, c, periph)

/* pa20d_i2sc1_ck */
#define PA20D_I2SC1_CK \
	SAM_PINMUX(a, 20, d, periph)

/* pa20x_afe0_ad9 */
#define PA20X_AFE0_AD9 \
	SAM_PINMUX(a, 20, x, extra)

/* pa20x_supc_wkup10 */
#define PA20X_SUPC_WKUP10 \
	SAM_PINMUX(a, 20, wkup10, wakeup)

/* pa21_gpio */
#define PA21_GPIO \
	SAM_PINMUX(a, 21, gpio, gpio)

/* pa21a_usart1_rxd */
#define PA21A_USART1_RXD \
	SAM_PINMUX(a, 21, a, periph)

/* pa21b_pmc_pck1 */
#define PA21B_PMC_PCK1 \
	SAM_PINMUX(a, 21, b, periph)

/* pa21c_pwmc1_pwmfi0 */
#define PA21C_PWMC1_PWMFI0 \
	SAM_PINMUX(a, 21, c, periph)

/* pa21x_afe0_ad1 */
#define PA21X_AFE0_AD1 \
	SAM_PINMUX(a, 21, x, extra)

/* pa21x_pio_piodcen2 */
#define PA21X_PIO_PIODCEN2 \
	SAM_PINMUX(a, 21, x, extra)

/* pa22_gpio */
#define PA22_GPIO \
	SAM_PINMUX(a, 22, gpio, gpio)

/* pa22a_ssc_rk */
#define PA22A_SSC_RK \
	SAM_PINMUX(a, 22, a, periph)

/* pa22b_pwmc0_pwmextrg1 */
#define PA22B_PWMC0_PWMEXTRG1 \
	SAM_PINMUX(a, 22, b, periph)

/* pa22c_ebi_ncs2 */
#define PA22C_EBI_NCS2 \
	SAM_PINMUX(a, 22, c, periph)

/* pa22x_pio_piodcclk */
#define PA22X_PIO_PIODCCLK \
	SAM_PINMUX(a, 22, x, extra)

/* pa23_gpio */
#define PA23_GPIO \
	SAM_PINMUX(a, 23, gpio, gpio)

/* pa23a_usart1_sck */
#define PA23A_USART1_SCK \
	SAM_PINMUX(a, 23, a, periph)

/* pa23b_pwmc0_pwmh0 */
#define PA23B_PWMC0_PWMH0 \
	SAM_PINMUX(a, 23, b, periph)

/* pa23c_ebi_a19 */
#define PA23C_EBI_A19 \
	SAM_PINMUX(a, 23, c, periph)

/* pa23d_pwmc1_pwml2 */
#define PA23D_PWMC1_PWML2 \
	SAM_PINMUX(a, 23, d, periph)

/* pa24_gpio */
#define PA24_GPIO \
	SAM_PINMUX(a, 24, gpio, gpio)

/* pa24a_usart1_rts */
#define PA24A_USART1_RTS \
	SAM_PINMUX(a, 24, a, periph)

/* pa24b_pwmc0_pwmh1 */
#define PA24B_PWMC0_PWMH1 \
	SAM_PINMUX(a, 24, b, periph)

/* pa24c_ebi_a20 */
#define PA24C_EBI_A20 \
	SAM_PINMUX(a, 24, c, periph)

/* pa24d_isi_pck */
#define PA24D_ISI_PCK \
	SAM_PINMUX(a, 24, d, periph)

/* pa25_gpio */
#define PA25_GPIO \
	SAM_PINMUX(a, 25, gpio, gpio)

/* pa25a_usart1_cts */
#define PA25A_USART1_CTS \
	SAM_PINMUX(a, 25, a, periph)

/* pa25b_pwmc0_pwmh2 */
#define PA25B_PWMC0_PWMH2 \
	SAM_PINMUX(a, 25, b, periph)

/* pa25c_ebi_a23 */
#define PA25C_EBI_A23 \
	SAM_PINMUX(a, 25, c, periph)

/* pa25d_hsmci_mcck */
#define PA25D_HSMCI_MCCK \
	SAM_PINMUX(a, 25, d, periph)

/* pa26_gpio */
#define PA26_GPIO \
	SAM_PINMUX(a, 26, gpio, gpio)

/* pa26a_usart1_dcd */
#define PA26A_USART1_DCD \
	SAM_PINMUX(a, 26, a, periph)

/* pa26b_tc0_tioa2 */
#define PA26B_TC0_TIOA2 \
	SAM_PINMUX(a, 26, b, periph)

/* pa26c_hsmci_mcda2 */
#define PA26C_HSMCI_MCDA2 \
	SAM_PINMUX(a, 26, c, periph)

/* pa26d_pwmc1_pwmfi1 */
#define PA26D_PWMC1_PWMFI1 \
	SAM_PINMUX(a, 26, d, periph)

/* pa27_gpio */
#define PA27_GPIO \
	SAM_PINMUX(a, 27, gpio, gpio)

/* pa27a_usart1_dtr */
#define PA27A_USART1_DTR \
	SAM_PINMUX(a, 27, a, periph)

/* pa27b_tc0_tiob2 */
#define PA27B_TC0_TIOB2 \
	SAM_PINMUX(a, 27, b, periph)

/* pa27c_hsmci_mcda3 */
#define PA27C_HSMCI_MCDA3 \
	SAM_PINMUX(a, 27, c, periph)

/* pa27d_isi_d7 */
#define PA27D_ISI_D7 \
	SAM_PINMUX(a, 27, d, periph)

/* pa28_gpio */
#define PA28_GPIO \
	SAM_PINMUX(a, 28, gpio, gpio)

/* pa28a_usart1_dsr */
#define PA28A_USART1_DSR \
	SAM_PINMUX(a, 28, a, periph)

/* pa28b_tc0_tclk1 */
#define PA28B_TC0_TCLK1 \
	SAM_PINMUX(a, 28, b, periph)

/* pa28c_hsmci_mccda */
#define PA28C_HSMCI_MCCDA \
	SAM_PINMUX(a, 28, c, periph)

/* pa28d_pwmc1_pwmfi2 */
#define PA28D_PWMC1_PWMFI2 \
	SAM_PINMUX(a, 28, d, periph)

/* pa29_gpio */
#define PA29_GPIO \
	SAM_PINMUX(a, 29, gpio, gpio)

/* pa29a_usart1_ri */
#define PA29A_USART1_RI \
	SAM_PINMUX(a, 29, a, periph)

/* pa29b_tc0_tclk2 */
#define PA29B_TC0_TCLK2 \
	SAM_PINMUX(a, 29, b, periph)

/* pa30_gpio */
#define PA30_GPIO \
	SAM_PINMUX(a, 30, gpio, gpio)

/* pa30a_pwmc0_pwml2 */
#define PA30A_PWMC0_PWML2 \
	SAM_PINMUX(a, 30, a, periph)

/* pa30b_pwmc1_pwmextrg0 */
#define PA30B_PWMC1_PWMEXTRG0 \
	SAM_PINMUX(a, 30, b, periph)

/* pa30c_hsmci_mcda0 */
#define PA30C_HSMCI_MCDA0 \
	SAM_PINMUX(a, 30, c, periph)

/* pa30d_i2sc0_do */
#define PA30D_I2SC0_DO \
	SAM_PINMUX(a, 30, d, periph)

/* pa30x_supc_wkup11 */
#define PA30X_SUPC_WKUP11 \
	SAM_PINMUX(a, 30, wkup11, wakeup)

